Revit 2027 API
SpatialElementBoundarySubface.SpatialBoundaryElement Property
 Element that gave rise to this room face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId SpatialBoundaryElement { get; }
Public ReadOnly Property SpatialBoundaryElement As LinkElementId
	Get
public:
property LinkElementId^ SpatialBoundaryElement {
	LinkElementId^ get ();
}
member SpatialBoundaryElement : LinkElementId with get
Property Value
LinkElementId
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace